src/Documents/Scan_ДвижениеИзделий/Scan_ДвижениеИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ДвижениеИзделий</name>
  <comment>Движение продуктов (scania)</comment>
  <registerRecords>AccumulationRegister.Scan_МестонахождениеИзделий</registerRecords>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрихода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НакладнаяТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЗаявки</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрихода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Scan_МестонахождениеИзделий/Scan_МестонахождениеИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Scan_МестонахождениеИзделий</name>
  <comment>Местонахождение продуктов (scania)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <type>
      <types>CatalogRef.Scan_ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПрихода</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/Scan_КлючевыеДатыПроцессов/Scan_КлючевыеДатыПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КлючевыеДатыПроцессов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUIDНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_ОбъектыКлючевыхДат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_КлючевыеДаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_КлючевыеДаты/Scan_КлючевыеДаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_КлючевыеДаты</name>
  <enumValues>
    <name>AAD</name>
    <comment>Actual Audit Date	Фактическая дата проведения аудита ПК ТС. </comment>
  </enumValues>
  <enumValues>
    <name>ADD</name>
    <comment>Actual Delivery Date	Фактическая дата прихода по первому адресу доставки, указанному в заказе, который отправлен на завод-изготовитель</comment>
  </enumValues>
  <enumValues>
    <name>ADDLBB</name>
    <comment>Actual Delivery Date Local BB	Фактическая дата прихода шасси на площадку кузовостроителя</comment>
  </enumValues>
  <enumValues>
    <name>AN</name>
    <comment>Audit Notification	Дата поступления вызова на аудит от кузовостроителя. </comment>
  </enumValues>
  <enumValues>
    <name>CDD</name>
    <comment>Confirm Delivery Date	Подтвержденная дата прихода по первому адресу доставки. </comment>
  </enumValues>
  <enumValues>
    <name>CDD2</name>
    <comment>Confirm Delivery Date	Подтвержденная дата прихода по первому адресу доставки. Отклонение от даты CDD</comment>
  </enumValues>
  <enumValues>
    <name>CDDX</name>
    <comment>Кол-во дней до даты CDD для отправки напоминания дилерам</comment>
  </enumValues>
  <enumValues>
    <name>CDDПоставщик</name>
    <comment>Confirm Delivery Date of contractor	Подтвержденная поставщиком дата прихода по первому адресу доставки. Дата из файла от поставщика</comment>
  </enumValues>
  <enumValues>
    <name>CRD</name>
    <comment>Confirm Ready Date	Плановая дата выхода продукта с конвейера на заводе. </comment>
  </enumValues>
  <enumValues>
    <name>DCD</name>
    <comment>Desired Customer Date Дата, когда клиент хочет получить готовый автомобиль у дилера</comment>
  </enumValues>
  <enumValues>
    <name>DD</name>
  </enumValues>
  <enumValues>
    <name>DD2</name>
  </enumValues>
  <enumValues>
    <name>DDD</name>
    <comment>Desired Delivery Date Желаемый срок поставки по первому адресу доставки, указанному в заказе на завод изготовитель</comment>
  </enumValues>
  <enumValues>
    <name>DDS</name>
    <comment>DD of SOP</comment>
  </enumValues>
  <enumValues>
    <name>EDD</name>
    <comment>Estimated Delivery Date	Предварительная дата готовности ПК ТС у кузовостроителя </comment>
  </enumValues>
  <enumValues>
    <name>ETA</name>
    <comment>Estimated Time of Arrival	Ожидаемая дата прихода транспортного средства на склад отгрузки</comment>
  </enumValues>
  <enumValues>
    <name>FinishDate</name>
    <comment>Finish Date	Это дата физической готовности продукта на заводе.</comment>
  </enumValues>
  <enumValues>
    <name>PAD</name>
    <comment>Planned Audit Date	Планируемая дата проведения аудита ПК ТС. </comment>
  </enumValues>
  <enumValues>
    <name>PDD</name>
    <comment>Preliminary Delivery Date	Предварительная дата прихода по первому адресу доставки</comment>
  </enumValues>
  <enumValues>
    <name>PODOD</name>
    <comment>Date of Delivery Дата поставки (дата, указываемая в заказе на закупку на надстройку/оборудование)</comment>
  </enumValues>
  <enumValues>
    <name>PTSD</name>
    <comment>PTS Date	Дата выписки ПТС на ПК ТС. </comment>
  </enumValues>
  <enumValues>
    <name>RDB</name>
  </enumValues>
  <enumValues>
    <name>RFT</name>
    <comment>Ready for Transfer	Фактическая дата готовности ПК ТС для передачи SRU. </comment>
  </enumValues>
  <enumValues>
    <name>SDDate</name>
    <comment>Specification Definite Date Последний день, когда спецификация заказа может быть изменена. Дата доступна в FAIN\Rain</comment>
  </enumValues>
  <enumValues>
    <name>SoW</name>
    <comment>Start of Warranty	Дата начала гарантии Скания. В SPII это Delivery Date</comment>
  </enumValues>
  <enumValues>
    <name>WED</name>
    <comment>Warranty End Date	Дата окончания гарантии</comment>
  </enumValues>
  <enumValues>
    <name>БроньДилера</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннийРезервДилера</name>
  </enumValues>
  <enumValues>
    <name>ДатаБукингЛиста</name>
  </enumValues>
  <enumValues>
    <name>ДатаИнвойса</name>
    <comment>14434</comment>
  </enumValues>
  <enumValues>
    <name>ДатаОтгрузкиСЗаводаПриEXW</name>
  </enumValues>
  <enumValues>
    <name>ДатаПередачиБУИзделияДилеру</name>
  </enumValues>
  <enumValues>
    <name>ДатаПередачиИзделияДилеру</name>
    <comment>Дата фактической передачи продукта дилеру </comment>
  </enumValues>
  <enumValues>
    <name>ДатаПокупкиБУИзделия</name>
  </enumValues>
  <enumValues>
    <name>ДатаПоступленияИзделияБУНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ДатаПоступленияИзделияНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ДатаПоступленияИнвойса1С</name>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиБУДилеру</name>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиБУКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиИзделия</name>
    <comment>Дата документа продажи продукта дилеру в 1С:УТ</comment>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиКлиенту</name>
    <comment>Дата документа продажи продукта клиенту в SDMS (в SOWA.net – это дата поставки), либо дата документа продажи продукта клиенту в 1С:УТ</comment>
  </enumValues>
  <enumValues>
    <name>ДатаПродажиПродуктаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ДатаСписания</name>
  </enumValues>
  <enumValues>
    <name>Квота</name>
  </enumValues>
  <enumValues>
    <name>ПортСПБ</name>
    <comment>ПортСПБ</comment>
  </enumValues>
  <enumValues>
    <name>ПродуктВАрхиве</name>
    <comment>Техническая дата, означающая проданный продукт, убывший из учета</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/Scan_ДвижениеИзделий/ObjectModule.bsl
//rarus tenkam 03.10.2016 mantis 7183 ++

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	//rarus tenkam 31.10.2017 mantis 11695 +++ теперь есть подписка на событие
	//Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
	//	ДатаПроведения = Дата('00010101');
	//ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
	//	ДатаПроведения = ТекущаяДата();
	//	
	//	//Проверим, вдруг изделие есть на каком-то маршруте или складе
	//КонецЕсли;	
	//
	//МенеджерНовый = ПользователиКлиентСервер.ТекущийПользователь();	
	//Если МенеджерНовый <> Менеджер Тогда
	//	Менеджер = МенеджерНовый;
	//	Организация = МенеджерНовый.Организация;
	//	ПодразделениеКомпании = МенеджерНовый.ПодразделениеОрганизации;
	//КонецЕсли;
	//rarus tenkam 31.10.2017 mantis 11695 ---
	//rarus sergei 09.11.2016 mantis 7163 ++
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), ИСТИНА, ЛОЖЬ));
	//rarus sergei 09.11.2016 mantis 7163 --
	
	// rarus tenkam 25.04.2018 mantis 13020 +++
	Если НЕ Ссылка.ПометкаУдаления И ПометкаУдаления Тогда 
		ЕстьДвижения = Ложь;
		Для Каждого ТекСтрока Из СоставЗаявки Цикл
			ЕстьДвижения = РегистрыНакопления.Scan_МестонахождениеИзделий.ЕслиДвиженияПослеРегистратора(ТекСтрока.Изделие, Ссылка, ТекСтрока.ДатаПрихода);
			Если ЕстьДвижения Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьДвижения Тогда
			Отказ = Истина;
			Сообщить("У продуктов документа есть перемещения, созданные позже даты прихода");
		КонецЕсли;			
	КонецЕсли;
	// rarus tenkam 25.04.2018 mantis 13020 ---
	
	//rarus vikhle 01.12.2020 mt 16823 +++
	Если Не Отказ И СоставЗаявки.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(СоставЗаявки.Изделие КАК Справочник.Scan_Изделия) КАК Изделие,
		               |	СоставЗаявки.ДатаПрихода КАК ДатаПрихода
		               |ПОМЕСТИТЬ СоставЗаявки
		               |ИЗ
		               |	&СоставЗаявки КАК СоставЗаявки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СоставЗаявки.ДатаПрихода КАК ДатаПрихода,
		               |	СоставЗаявки.Изделие КАК Изделие
		               |ИЗ
		               |	СоставЗаявки КАК СоставЗаявки
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	СоставЗаявки.Изделие.НомерИзделия";
		Запрос.УстановитьПараметр("СоставЗаявки",СоставЗаявки.Выгрузить());
		ОтсортированнаяТЗ = Запрос.Выполнить().Выгрузить();
		СоставЗаявки.Загрузить(ОтсортированнаяТЗ);
	КонецЕсли;	
	//rarus vikhle 01.12.2020 mt 16823 ---
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//rarus tenkam05.03.2017 mantis 6897 +++
	//Движения.Scan_МестонахождениеИзделий.Записывать = Истина;
	//Движения.Записать();
	//Движения.Scan_МестонахождениеИзделий.Записывать = Истина;
	//Движения.Scan_МестонахождениеИзделий.Очистить();
	//rarus tenkam 21.03.2017 mantis 9109 +++
	//НаборЗаписейМестонахождениеИзделий = РегистрыНакопления.Scan_МестонахождениеИзделий.СоздатьНаборЗаписей();
	//НаборЗаписейМестонахождениеИзделий.Отбор.Регистратор.Значение = Ссылка;
	//НаборЗаписейМестонахождениеИзделий.Очистить();
	//НаборЗаписейМестонахождениеИзделий.ДополнительныеСвойства.Вставить("ОчисткаПередЗаписью", Истина);
	//НаборЗаписейМестонахождениеИзделий.Записать();
	//rarus tenkam 21.03.2017 mantis 9109 ---
	Движения.Scan_МестонахождениеИзделий.Записывать = Истина;
	
	Для Индекс = 0 по СоставЗаявки.Количество()-1 Цикл
		СтрокаИзделия = СоставЗаявки.Получить(Индекс);
		
		//rarus tenkam 21.03.2017 mantis 9109 +++
		ДанныеМестоположения = РегистрыНакопления.Scan_МестонахождениеИзделий.ПолучитьДанныеПоМестонахождениюИзделия(СтрокаИзделия.Изделие, СтрокаИзделия.ДатаПрихода, Ссылка);
		МестоположениеИзделия = ?(ДанныеМестоположения = Неопределено, Неопределено, ДанныеМестоположения.МестоХранения);
		ДатаПриходаИзделия = ?(ДанныеМестоположения = Неопределено, Дата('00010101'), ДанныеМестоположения.ДатаПрихода); 
		//rarus tenkam 21.03.2017 mantis 9109 ---
				
		Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПоступлениеНаСклад ИЛИ
			ХозОперация = Справочники.Scan_ХозяйственныеОперации.ВводНачальныхОстатков Тогда
			//rarus tenkam 21.03.2017 mantis 9109 +++
			//МестоположениеИзделия = РегистрыНакопления.Scan_МестонахождениеИзделий.ПолучитьМестоположениеИзделия(СтрокаИзделия.Изделие, ТекущаяДата());
			//rarus tenkam 21.03.2017 mantis 9109 ---
			//rarus bonmak 22.12.2020 16653 ++
			ДатаСписанияИзделия = РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЧтениеЗначенияРегистраСведения(СтрокаИзделия.Изделие,
			Перечисления.Scan_КлючевыеДаты.ПолучитьОбъектКлючевойДатыПоПеречислению(Перечисления.Scan_КлючевыеДаты.ДатаСписания),
			Перечисления.Scan_КлючевыеДаты.ДатаСписания, ТекущаяДата());
			Если ДатаСписанияИзделия <> Дата(1,1,1) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "В строке " + (Индекс+1) + " изделие убыло из учета " + Формат(ДатаСписанияИзделия,"ДЛФ=Д") + " в связи со списанием";
				Сообщение.Поле = "СоставЗаявки[" + Индекс + "].Изделие";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
			//rarus bonmak 22.12.2020 16653 --
			// Приход
			Движение = Движения.Scan_МестонахождениеИзделий.Добавить();
			Движение.ВидДвижения =  ВидДвиженияНакопления.Приход;
			Движение.Период = СтрокаИзделия.ДатаПрихода;
			Движение.Изделие = СтрокаИзделия.Изделие;
			Движение.МестоХранения = МестоХранения;
			Движение.ДатаПрихода = СтрокаИзделия.ДатаПрихода;
			Движение.Количество = 1;
			Движение.ХозОперация = ХозОперация;
			Движение.Пользователь =  ПользователиКлиентСервер.ТекущийПользователь();
			
			Если МестоположениеИзделия <> Неопределено Тогда
				//rarus tenkam 21.03.2017 mantis 9109 +++
				//ДатаПриходаИзделия = РегистрыНакопления.Scan_МестонахождениеИзделий.ПолучитьДатуПриходаИзделия(СтрокаИзделия.Изделие, МестоположениеИзделия);
				//rarus tenkam 21.03.2017 mantis 9109 +++
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "В строке " + (Индекс+1) + " изделие уже оприходовано на " + МестоположениеИзделия + " " + Формат(ДатаПриходаИзделия,"ДЛФ=Д");
				Сообщение.Поле = "СоставЗаявки[" + Индекс + "].Изделие";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;	
			КонецЕсли;
			
		Иначе
			//rarus tenkam 21.03.2017 mantis 9109 +++
			//МестоположениеИзделия = РегистрыНакопления.Scan_МестонахождениеИзделий.ПолучитьМестоположениеИзделия(СтрокаИзделия.Изделие, СтрокаИзделия.ДатаПрихода);
			//rarus tenkam 21.03.2017 mantis 9109 ---
				
			//Это убытие из учета
			Если МестоположениеИзделия <> МестоХранения Тогда
				Сообщение = Новый СообщениеПользователю();
				Если НЕ ЗначениеЗаполнено(МестоположениеИзделия) Тогда
					Сообщение.Текст = "В строке " + (Индекс+1) + " изделие на дату убытия не находится в месте хранения";
				Иначе
					Сообщение.Текст = "В строке " + (Индекс+1) + " изделие на дату убытия находится на " + МестоположениеИзделия;
				КонецЕсли;
				Сообщение.Поле = "СоставЗаявки[" + Индекс + "].Изделие";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
			//rarus tenkam 21.03.2017 mantis 9109 +++
			//МестонахождениеИзделия = РегистрыНакопления.Scan_МестонахождениеИзделий.ПолучитьМестонахождениеИДатуПриходаИзделия(СтрокаИзделия.Изделие, КонецДня(СтрокаИзделия.ДатаПрихода));
			//rarus tenkam 21.03.2017 mantis 9109 +++
				
			// Расход
			Движение = Движения.Scan_МестонахождениеИзделий.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = СтрокаИзделия.ДатаПрихода;
			Движение.Изделие = СтрокаИзделия.Изделие;
			Движение.МестоХранения = МестоХранения;
			//rarus tenkam 21.03.2017 mantis 9109 +++
			//Движение.ДатаПрихода = МестонахождениеИзделия.ДатаПрихода;
			Движение.ДатаПрихода = ДатаПриходаИзделия;
			//rarus tenkam 21.03.2017 mantis 9109 ---
			Движение.Количество = 1;
			Движение.ХозОперация = ХозОперация;
			Движение.Пользователь =  ПользователиКлиентСервер.ТекущийПользователь();
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка на заполнение табличной части
	Если СоставЗаявки.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Табличная часть пустая!";
		Сообщение.Поле = "СоставЗаявки";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		Отказ = Истина;
	КонецЕсли;
	
	//Проверка на заполнение даты прихода\убытия
	Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПоступлениеНаСклад Тогда
		Если НЕ ЗначениеЗаполнено(ДатаПрихода) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Дата прихода не заполнена!";
			Сообщение.Поле = "ДатаПрихода";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;	
		Иначе
			Если ДатаПрихода > ТекущаяДата() Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Дата прихода больше текущей даты!";
				Сообщение.Поле = "ДатаПрихода";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;			
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ХозОперация = Справочники.Scan_ХозяйственныеОперации.ВводНачальныхОстатков Тогда
		Для Индекс = 0 по СоставЗаявки.Количество()-1 Цикл
			СтрокаИзделия = СоставЗаявки.Получить(Индекс);
			Если НЕ ЗначениеЗаполнено(СтрокаИзделия.ДатаПрихода) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "В строке " + (Индекс+1) + " не заполнена дата прихода!";
				Сообщение.Поле = "СоставЗаявки[" + Индекс + "].ДатаПрихода";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;	
			Иначе
				Если СтрокаИзделия.ДатаПрихода > ТекущаяДата() Тогда
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "В строке " + (Индекс+1) + " дата прихода больше текущей даты!";
					Сообщение.Поле = "СоставЗаявки[" + Индекс + "].ДатаПрихода";
					Сообщение.УстановитьДанные(ЭтотОбъект);
					Сообщение.Сообщить();
					Отказ = Истина;	
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если НЕ ЗначениеЗаполнено(ДатаПрихода) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Дата убытия не заполнена!";
			Сообщение.Поле = "ДатаПрихода";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;	
		Иначе
			Если ДатаПрихода > ТекущаяДата() Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Дата убытия больше текущей даты!";
				Сообщение.Поле = "ДатаПрихода";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Проверка на заполнение места хранения
	Если НЕ ЗначениеЗаполнено(МестоХранения) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Место хранения не заполнено!";
		Сообщение.Поле = "МестоХранения";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;	
	КонецЕсли;
	
	//rarus tenkam 13.10.2016 mantis 7688 ++
	// Проверка на одинаковые изделия в ТЧ
	НоваяТЗ = Новый ТаблицаЗначений;
	НоваяТЗ.Колонки.Добавить("Изделие");
	НоваяТЗ.Колонки.Добавить("Количество");
	Для Каждого СтрокаТЗ Из СоставЗаявки Цикл
		НоваяСтрока = НоваяТЗ.Добавить();
		НоваяСтрока.Изделие = СтрокаТЗ.Изделие;
		НоваяСтрока.Количество = 1;	
	КонецЦикла;
	НоваяТЗ.Свернуть("Изделие","Количество");
	Для Каждого СтрокаТЗ Из НоваяТЗ Цикл;
		Если СтрокаТЗ.Количество <> 1 Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В табличной части одинаковые изделия " + СтрокаТЗ.Изделие;
			Сообщение.Поле = "СоставЗаявки";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	//rarus tenkam 13.10.2016 mantis 7688 --
	
КонецПроцедуры
//rarus tenkam 03.10.2016 mantis 7183 --

// rarus tenkam 17.06.2019 mantis 14476 +++ 
Процедура ОбработкаУдаленияПроведения(Отказ)
	ЕстьДвижения = Ложь;
	Для Каждого ТекСтрока Из СоставЗаявки Цикл
		ЕстьДвижения = РегистрыНакопления.Scan_МестонахождениеИзделий.ЕслиДвиженияПослеРегистратора(ТекСтрока.Изделие, Ссылка, ТекСтрока.ДатаПрихода);
		Если ЕстьДвижения Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьДвижения Тогда
		Отказ = Истина;
		Сообщить("У продуктов документа есть перемещения, созданные позже даты прихода");
	КонецЕсли;			
КонецПроцедуры
// rarus tenkam 17.06.2019 mantis 14476 ---
